# Реализуйте алгоритм генерации случайного числа.(Не используя библиотеки связанные с рандомом) 
# (Доп задача, не влияющая на оценку)

# Генератор случайного целого числа от 0 до 9
import time
time_str = str(time.time())
print(time_str[-1])
