#Задайте словарь из n чисел последовательности (1 + (1/n))^n и выведите на экран их сумму.
#    - Для n = 3:  {1: 2, 2: 2.25 , 3: 2.37}
#    Необходимо сложить все значения словаря и вывести  сумму на экран.

n = int(input("Введите n: "))
di_for_n = {}
sum = 0
for i in range(1, n + 1):
    di_for_n[i] = round((1 + (1 / i))**i, 2)
    sum += di_for_n[i]
print(di_for_n)
print (f"Сумма всех значений словаря = {sum}")