# Напишите программу, которая принимает на вход координаты двух точек 
# и находит расстояние между ними в 2D пространстве.

x_a, y_a = map(int,input ("Введите координаты первой точки: ").split())
x_b, y_b = map(int,input("Введите координаты второй точки: ").split())
distans = round((((x_b - x_a)**2 + (y_b - y_a)**2)**0.5), 2)
print(f"Расстояние между точками = {distans}")