# Напишите программу, которая принимает на вход координаты точки (X и Y), 
# причём X ≠ 0 и Y ≠ 0 и выдаёт номер четверти плоскости, в которой находится эта точка 
# (или на какой оси она находится).

x = int(input ("Введите координату х = "))
y = int(input("Введите координату у = "))
if x == 0 and y == 0:
    print ("Ошибка! точка не должна лежать в начале координат!")
elif x == 0:
    print ("Точка лежит на оси ОХ")
elif y == 0:
    print ("Точка лежит на оси ОУ")
elif x > 0:
    if y > 0:
        print ("Точка пренадлежит I четверти")
    else:
        print ("Точка пренадлежит IV четверти")
elif x < 0:
    if y > 0:
        print ("Точка пренадлежит II четверти")
    else:
        print ("Точка пренадлежит III четверти") 
else:
    print ("Что-то пошло не так :(")